{
  "common.portfolioTItle": "Sungjun Portfolio",
  "common.introduce1": "Patient and persevering",
  "common.introduce2": "I am a frontend developer.",
  "common.contact": "Contact",
  "common.phone": "Phone",
  "common.mail": "Mail",
  "common.gitHub": "GitHub",
  "common.blog": "Blog",
  "chat.hello": "Thank you for visiting.",
  "chat.selectQuestion": "Select your desired question category!",
  "chat.question1": "1. Memorable Project Experience",
  "chat.answer1-1": "The most memorable project among the ones I worked on over the past year",
  "chat.answer1-2": "The most memorable project during my one-year tenure at Autowini was the recent development of the claims system.",
  "chat.answer1-3": "What is a claims system?",
  "chat.answer1-4": "It is a chat consultation system that allows buyers to raise issues or defects with Autowini within 30 days of purchasing a vehicle.",
  "chat.answer1-5": "Three reasons why the \"claims project\" is the most memorable",
  "chat.answer1-6": "1. While the Autowini project is based on JSP, the claims system was separated as an SPA using React since it didn't require SEO. We integrated it using AWS CDI. Although the backend team handled the infrastructure work, I gained experience in developing using this approach.",
  "chat.answer1-7": "2. Many companies demand from frontend developers the ability to deeply develop responsive UI, which was also an area of interest for me. It was satisfying to be able to develop responsive UI for the claims system, not only for web and mobile but also to control IOS and Android screens via web views.",
  "chat.answer1-8": "3. From the initial project setup to the design, I handled everything on my own. It was gratifying to implement the translation system (automated via the i18n library) in this project myself, despite it being previously implemented in other projects.",
  "chat.answer1-9": "This claims system development project has left the most memorable impression on me as it provided me with numerous challenges and a sense of accomplishment. It also offered me opportunities for technical growth and gaining new experiences.",
  "chat.answer1-10": "operating video",
  "chat.question2": "2. Technology stack",
  "chat.answer2-1": "What are the commonly used frontend tech stacks?",
  "chat.answer2-2": "Language",
  "chat.answer2-3": "Framework",
  "chat.answer2-4": "Styling",
  "chat.answer2-5": "State management",
  "chat.answer2-6": "Global state management",
  "chat.answer2-7": "The reason for choosing ReactJs among various frameworks",
  "chat.answer2-8": "React is used by many developers worldwide, so if issues arise during development, a wealth of information is easily accessible through Google searches or communities like Stack Overflow. Additionally, React adopts a component-based architecture, allowing specific parts of the UI to be separated into reusable components. This makes it easier to manage the code on a component level, facilitating maintenance even as the project grows larger. For these reasons, React was chosen.",
  "chat.question3": "3. Performance optimization experience",
  "chat.answer3-1": "What techniques or methods have you used to optimize the performance of web applications?",
  "chat.answer3-2": "1. Improve SEO",
  "chat.answer3-3": "In a React project that is a SPA, I used the React-helmet library to dynamically adjust the title, description, and keywords of each page to improve SEO.",
  "chat.answer3-4": "I have achieved results by ensuring that pages are better recognized and exposed by search engines.",
  "chat.answer3-5": "2. Image Optimization",
  "chat.answer3-6": "I used Akamai CDN for image optimization to efficiently manage the images used on web pages and enhance performance.",
  "chat.answer3-7": "By caching images through the CDN and optimizing delivery speed, I improved the user experience.",
  "chat.answer3-8": "3. Rendering Performance Optimization",
  "chat.answer3-9": "By utilizing the Image component in Next.js, I optimized the rendering speed and performance of pages by blurring local images and implementing lazy loading.",
  "chat.answer3-10": "I have optimized performance by adjusting image sizes appropriately through Cloudflare for faster page loading.",
  "chat.answer3-11": "4. API Request Optimization",
  "chat.answer3-12": "To enhance the application's performance, I minimized API requests by utilizing the useQuery, useInfiniteQuery, and useMutation functions from the react-query library.",
  "chat.answer3-13": "I optimized network usage and efficiently managed data to provide users with better performance.",
  "chat.answer3-14": "5. Personal Blog SEO Optimization",
  "chat.answer3-15": "I conducted SEO work to ensure that my personal blog appears at the top of Google search results for the query \"엄성준.\"",
  "chat.answer3-16": "Um sungjun's Personal Blog"
}