{
  "common.portfolioTItle": "Sungjun Portfolio",
  "common.introduce1": "Patient and persevering",
  "common.introduce2": "I am a frontend developer.",
  "common.contact": "Contact",
  "common.phone": "Phone",
  "common.mail": "Mail",
  "common.gitHub": "GitHub",
  "common.blog": "Blog",
  "common.imgTouch": "(Touch the image to enlarge.)",
  "chat.hello": "Thank you for visiting.",
  "chat.selectQuestion": "Select your desired question category!",
  "gitAndBlog": "GitHub & Blog",
  "visitGit": "Visit GitHub",
  "visitBlog": "Visit Blog",
  "chat.question1": "Memorable Project Experience",
  "chat.answer1-1": "The most memorable project among the ones I worked on over the past year",
  "chat.answer1-2": "The most memorable project during my one-year tenure at Autowini was the recent development of the claims system.",
  "chat.answer1-3": "What is a claims system?",
  "chat.answer1-4": "It is a chat consultation system that allows buyers to raise issues or defects with Autowini within 30 days of purchasing a vehicle.",
  "chat.answer1-5": "Three reasons why the \"claims project\" is the most memorable",
  "chat.answer1-6": "1. While the Autowini project is based on JSP, the claims system was separated as an SPA using React since it didn't require SEO. We integrated it using AWS CDI. Although the backend team handled the infrastructure work, I gained experience in developing using this approach.",
  "chat.answer1-7": "2. Many companies demand from frontend developers the ability to deeply develop responsive UI, which was also an area of interest for me. It was satisfying to be able to develop responsive UI for the claims system, not only for web and mobile but also to control IOS and Android screens via web views.",
  "chat.answer1-8": "3. From the initial project setup to the design, I handled everything on my own. It was gratifying to implement the translation system (automated via the i18n library) in this project myself, despite it being previously implemented in other projects.",
  "chat.answer1-9": "This claims system development project has left the most memorable impression on me as it provided me with numerous challenges and a sense of accomplishment. It also offered me opportunities for technical growth and gaining new experiences.",
  "chat.answer1-10": "operating video",
  "chat.question2": "Technology stack",
  "chat.answer2-1": "What are the commonly used frontend tech stacks?",
  "chat.answer2-2": "Language",
  "chat.answer2-3": "Framework",
  "chat.answer2-4": "Styling",
  "chat.answer2-5": "State management",
  "chat.answer2-6": "Global state management",
  "chat.answer2-7": "The reason for choosing ReactJs among various frameworks",
  "chat.answer2-8": "React is used by many developers worldwide, so if issues arise during development, a wealth of information is easily accessible through Google searches or communities like Stack Overflow. Additionally, React adopts a component-based architecture, allowing specific parts of the UI to be separated into reusable components. This makes it easier to manage the code on a component level, facilitating maintenance even as the project grows larger. For these reasons, React was chosen.",
  "chat.question3": "Performance optimization experience",
  "chat.answer3-1": "What techniques or methods have you used to optimize the performance of web applications?",
  "chat.answer3-2": "1. Improve SEO",
  "chat.answer3-3": "In a React project that is a SPA, I used the React-helmet library to dynamically adjust the title, description, and keywords of each page to improve SEO.",
  "chat.answer3-4": "I have achieved results by ensuring that pages are better recognized and exposed by search engines.",
  "chat.answer3-5": "2. Image Optimization",
  "chat.answer3-6": "I used Akamai CDN for image optimization to efficiently manage the images used on web pages and enhance performance.",
  "chat.answer3-7": "By caching images through the CDN and optimizing delivery speed, I improved the user experience.",
  "chat.answer3-8": "3. Rendering Performance Optimization",
  "chat.answer3-9": "By utilizing the Image component in Next.js, I optimized the rendering speed and performance of pages by blurring local images and implementing lazy loading.",
  "chat.answer3-10": "I have optimized performance by adjusting image sizes appropriately through Cloudflare for faster page loading.",
  "chat.answer3-11": "4. API Request Optimization",
  "chat.answer3-12": "To enhance the application's performance, I minimized API requests by utilizing the useQuery, useInfiniteQuery, and useMutation functions from the react-query library.",
  "chat.answer3-13": "I optimized network usage and efficiently managed data to provide users with better performance.",
  "chat.answer3-14": "5. Personal Blog SEO Optimization",
  "chat.answer3-15": "I conducted SEO work to ensure that my personal blog appears at the top of Google search results for the query \"엄성준.\"",
  "chat.answer3-16": "Um sungjun's Personal Blog",
  "chat.question4": "Responsive design and web accessibility",
  "chat.answer4-1": "Responsive design",
  "chat.answer4-2": "The portfolio project you are currently viewing is a web app designed to function properly across various environments. Responsive design has been applied to provide an optimal user experience on all devices, including web and mobile. Currently, Tailwind CSS is used to implement responsive features, but the same responsive web design can also be achieved using basic CSS or Styled-components.",
  "chat.answer4-3": "Efforts to improve web accessibility",
  "chat.answer4-4": "Utilization of meta tags",
  "chat.answer4-5": "Search engine optimization (SEO) is being conducted by appropriately using meta tags such as title, description, and keywords within the head tag. We are aware that, according to the latest trends, the indiscriminate use of keywords can actually have a negative impact.",
  "chat.answer4-6": "Use of semantic tags",
  "chat.answer4-7": "We are using semantic tags to improve code readability and to ensure that search engines and accessibility tools can better understand our content.",
  "chat.answer4-8": "The alt attribute of the img tag",
  "chat.answer4-9": "We strictly adhere to adding the alt attribute to img tags to ensure web accessibility for visually impaired users.",
  "chat.answer4-10": "Understanding and maintaining design patterns",
  "chat.answer4-11": "We maintain consistent design by using standardized UI elements such as buttons, ensuring cohesive design and enhancing user experience.",
  "chat.question5": "Cross-browser experience",
  "chat.question5-1": "Problem situation",
  "chat.question5-2": "Solution to the problem",
  "chat.question5-3": "1. Resolving the issue of the keyboard covering the screen in iOS environment.",
  "chat.question5-4": "While developing the AutoWini claims project, I needed to implement a responsive web design using React to ensure that the chat UI worked seamlessly across web, mobile, and app platforms. Most environments posed no issues, but in the iOS environment, a problem arose where the keyboard would cover the screen when typing into input or textarea fields, due to the screen width not being recognized correctly.",
  "chat.question5-5": "Example image",
  "chat.question5-6": "To solve this problem, I used CSS and JavaScript to dynamically reset the vh (viewport height) value when the screen height changes. Here is the specific code",
  "chat.question5-7": "2. Resolving the issue of the keyboard covering the screen in iOS environment",
  "chat.question5-8": "There was an issue where CSS that worked correctly in Chrome did not function properly in Safari.",
  "chat.question5-9": "Left: Safari, Right: Chrome",
  "chat.question5-10": "To solve this issue, I utilized an online platform (https://www.sassmeister.com) to test and execute Sass code. By optimizing the CSS code and separating the CSS code using child element selectors, I was able to resolve the problem successfully.",
  "chat.question6": "Personal Project Experience",
  "chat.question6-1": "Project Name",
  "chat.question6-2": "Duration",
  "chat.question6-3": "Technologies Used",
  "chat.question6-4": "Brief Description",
  "chat.question6-5": "Detailed Description",
  "chat.question6-6": "GitHub Link",
  "chat.question6-7": "Live Site Link",
  "chat.question6.project1": "This is a shopping mall project built using React and TypeScript, utilizing data from the Fake Store API.",
  "chat.question6.project2": "This is a Pokédex project built using React and TypeScript, utilizing data from the Poke API.",
  "chat.question6.project3": "This is a community site where travel enthusiasts can share information and communicate with each other.",
  "chat.question6.project4": "This is a personal portfolio project developed using Next.js and TypeScript.",
  "chat.question6.project5": "This is a personal portfolio project developed using React and TypeScript."
}